Tekla.Structures.ModelInternal.dotSetGetProperty_t
Serialization structure for the Set property method

Tekla.Structures.ModelInternal.dotSetGetProperty_t.aName
Name of the property

Tekla.Structures.ModelInternal.dotSetGetProperty_t.PropertyType
Type of the property

Tekla.Structures.ModelInternal.dotSetGetProperty_t.OperationType
Where to get the property (UDA/Report)

Tekla.Structures.ModelInternal.dotSetGetProperty_t.PhaseNumber
The phase number

Tekla.Structures.ModelInternal.dotSetGetProperty_t.IntValue
Integer return value

Tekla.Structures.ModelInternal.dotSetGetProperty_t.DoubleValue
Double return value

Tekla.Structures.ModelInternal.dotSetGetProperty_t.aStringValue
String return value